import re 




file_name=  """ <b>20 февраля, понедельник</b>
                <p>13:05, 13:35, Классный час</b></p>
                <p>08:00, 09:30, Литература, Смолянинова В.А., ауд. 406-1</p>
                <p>09:40, 11:10, Большие данные, Каламбет В.Б., ауд. 414-1</p>
                <p>11:30, 13:00, Русский язык, Смолянинова В.А., ауд. 406-1</p>
                <p>13:40, 15:10, Человек в современном мире, Марышева  О.В., ауд. 121-1</p>
                <hr/>

                <b>21 февраля, вторник</b>
                <p>08:00, 09:30, Математика, Джалагония  М.Ш., ауд. 416-1</p>
                <p>09:40, 11:10, Информатика, Федосеева  В.Ф., ауд. 401-1</p>
                <p>11:30, 13:00, Иностранный язык, Лебедева  М.В., ауд. 214-1</p>
                <p>11:30, 13:00, Иностранный язык, Чубарова А.Б., ауд. 106-1</p>
                <p>13:10, 14:40, Литература, Смолянинова В.А., ауд. 121-1</p>
                <hr/>

                <b>22 февраля, среда</b>
                <p>08:00, 09:30, Экологические основы природопользования, Кравченко  И.Ю., ауд. 118-1</p>
                <p>09:40, 11:10, Физика, Дронова  Р.В., ауд. 323-1</p>
                <p>11:30, 13:00, Физическая культура, Щербакова Э.Н., ауд. с/з2-1</p>
                <p>13:10, 14:40, Информатика, Федосеева  В.Ф., ауд. 401-1</p>
                <hr/>

                <b>25 февраля, суббота</b>
                <p>08:00, 09:30, История, Иваненков  П.П., ауд. 217-1</p>
                <p>09:40, 11:10, Математика, Джалагония  М.Ш., ауд. 416-1</p>
                <p>11:30, 13:00, Математика, Джалагония  М.Ш., ауд. 416-1</p>
                <p>13:10, 14:40, Физика, Дронова  Р.В., ауд. 323-1</p>
                <p></p>
            """
with open("pars.txt", "r") as f:
    contents = f.readlines()
contents.insert(0)
with open("pars.txt", "w") as f:
    contents = "".join(contents)
    f.write(contents)

print(file_name.replace('</p>', "<b>{}</b>"))
#print(re.sub(r'(\d\d)/(\d\d)/(\d{4})', r'\2.\1.\3', file_name)) 